# Pandas uždavyniai

In [1]:
# tips lentelė:
# total_bill: Pirkinio suma
# tip: Arbatpinigiai
# sex: Lytis
# smoker: Ar rūko?
# day: Savaitės diena
# time: Vakarienė arba pietūs
# dydis: Kiek patiekalų užsisakė

## 1. Užduotis

In [1]:
import os
os.getcwd()

'C:\\Users\\Asosi\\OneDrive\\Duomenų analitika 2020.06\\Python\\2 paskaita'

In [4]:
os.chdir('C:\\Users\\Asosi\\OneDrive\\Duomenų analitika 2020.06\\Python')

Įkelkite tips.csv.

In [5]:
import pandas as pd

path = 'data/tips.csv'
data = pd.read_csv(path)
data

     total_bill   tip     sex smoker   day    time  size
0         16.99  1.01  Female     No   Sun  Dinner     2
1         10.34  1.66    Male     No   Sun  Dinner     3
2         21.01  3.50    Male     No   Sun  Dinner     3
3         23.68  3.31    Male     No   Sun  Dinner     2
4         24.59  3.61  Female     No   Sun  Dinner     4
..          ...   ...     ...    ...   ...     ...   ...
239       29.03  5.92    Male     No   Sat  Dinner     3
240       27.18  2.00  Female    Yes   Sat  Dinner     2
241       22.67  2.00    Male    Yes   Sat  Dinner     2
242       17.82  1.75    Male     No   Sat  Dinner     2
243       18.78  3.00  Female     No  Thur  Dinner     2

[244 rows x 7 columns]

## 2. Užduotis

Kiek eilučių ir stulpelių turi tips lentelė?

In [6]:
data.shape

(244, 7)

## 3. Užduotis

Ar yra trūkstamų reikšmių?

In [7]:
data.isnull().sum()

total_bill    0
tip           0
sex           0
smoker        0
day           0
time          0
size          0
dtype: int64

## 4. Užduotis

Kuriuo metu dažniausiai valgoma? Ar skiriai vyrų ir moterų įpročiai?

In [19]:
data['time'].value_counts()

Dinner    176
Lunch      68
Name: time, dtype: int64

In [8]:
pd.pivot_table(data, 
               index=['sex'], 
               columns=['time'], 
               aggfunc={'total_bill':'count'})

       total_bill
time       Dinner Lunch
sex
Female         52    35
Male          124    33

In [12]:
data.groupby(['sex','time'])['total_bill'].count().unstack()

time    Dinner  Lunch
sex
Female      52     35
Male       124     33

## 5. Užduotis

Koks vidutinis patiekalų skačius (vyrų ir moterų atskirai)?

In [16]:
data.groupby(['sex'])['size'].mean()

sex
Female    2.459770
Male      2.630573
Name: size, dtype: float64

## 6. Užduotis

Koks vidutiniškai kainuoja valgymas (atsižvelgiant į lytį, dieną ir dienos laiką)?

In [31]:
pd.pivot_table(data, 
               index=['sex'], 
               columns=['day','time'], 
               aggfunc={'total_bill':'mean'})

       total_bill
day           Fri                   Sat        Sun   Thur
time       Dinner      Lunch     Dinner     Dinner Dinner      Lunch
sex
Female  14.310000  13.940000  19.680357  19.872222  18.78  16.648710
Male    23.487143  11.386667  20.802542  21.887241    NaN  18.714667

In [17]:
data.groupby(['sex','day','time'])['total_bill'].mean().unstack()

time            Dinner      Lunch
sex    day
Female Fri   14.310000  13.940000
       Sat   19.680357        NaN
       Sun   19.872222        NaN
       Thur  18.780000  16.648710
Male   Fri   23.487143  11.386667
       Sat   20.802542        NaN
       Sun   21.887241        NaN
       Thur        NaN  18.714667

## 7. Užduotis

Koks vidutiniškai paliekama arbatpinigų (atsižvelgiant į lytį, dieną ir dienos laiką)?

In [30]:
pd.pivot_table(data, 
               index=['sex'], 
               columns=['day','time'], 
               aggfunc={'tip':'mean'})

             tip
day          Fri              Sat       Sun   Thur
time      Dinner  Lunch    Dinner    Dinner Dinner     Lunch
sex
Female  2.810000  2.745  2.801786  3.367222    3.0  2.561935
Male    3.032857  1.900  3.083898  3.220345    NaN  2.980333

In [18]:
data.groupby(['sex','day','time'])['tip'].mean().unstack()

time           Dinner     Lunch
sex    day
Female Fri   2.810000  2.745000
       Sat   2.801786       NaN
       Sun   3.367222       NaN
       Thur  3.000000  2.561935
Male   Fri   3.032857  1.900000
       Sat   3.083898       NaN
       Sun   3.220345       NaN
       Thur       NaN  2.980333

## 8. Užduotis

Koks yra santykis tarp patiekalų kainos ir arbatpinigių (atsižvelgiant į lytį, dieną ir dienos laiką)? 

Kas palieka daugiau arbatpinigių - vyrai ar moterys?

Moteris procentiškai nuo saskaitos palieka daugiau arbatos, taciau vyrai palieka daugiau arbatos absoliutine reiksme.

Kuriuo metu galima tikėtis gauti daugiau arbatpinigių?
vakare, sestadieni ir sekmadieni

In [29]:
data['santykis'] = data['tip'] / data['total_bill']
data

     total_bill   tip     sex smoker   day    time  size  santykis
0         16.99  1.01  Female     No   Sun  Dinner     2  0.059447
1         10.34  1.66    Male     No   Sun  Dinner     3  0.160542
2         21.01  3.50    Male     No   Sun  Dinner     3  0.166587
3         23.68  3.31    Male     No   Sun  Dinner     2  0.139780
4         24.59  3.61  Female     No   Sun  Dinner     4  0.146808
..          ...   ...     ...    ...   ...     ...   ...       ...
239       29.03  5.92    Male     No   Sat  Dinner     3  0.203927
240       27.18  2.00  Female    Yes   Sat  Dinner     2  0.073584
241       22.67  2.00    Male    Yes   Sat  Dinner     2  0.088222
242       17.82  1.75    Male     No   Sat  Dinner     2  0.098204
243       18.78  3.00  Female     No  Thur  Dinner     2  0.159744

[244 rows x 8 columns]

In [28]:
data.groupby(['sex','day','time'])['santykis'].mean().unstack()

time           Dinner     Lunch
sex    day
Female Fri   0.199115  0.199731
       Sat   0.156470       NaN
       Sun   0.181569       NaN
       Thur  0.159744  0.157453
Male   Fri   0.130203  0.174144
       Sat   0.151577       NaN
       Sun   0.162344       NaN
       Thur       NaN  0.165276

In [31]:
data.groupby(['sex'])['santykis'].mean()

sex
Female    0.166491
Male      0.157651
Name: santykis, dtype: float64

In [34]:
data.groupby(['sex'])['tip'].mean()

sex
Female    2.833448
Male      3.089618
Name: tip, dtype: float64

In [38]:
data.groupby(['sex','day','time'])['tip'].sum().unstack()

time         Dinner  Lunch
sex    day
Female Fri    14.05  10.98
       Sat    78.45    NaN
       Sun    60.61    NaN
       Thur    3.00  79.42
Male   Fri    21.23   5.70
       Sat   181.95    NaN
       Sun   186.78    NaN
       Thur     NaN  89.41

## 9. Užduotis

Kas vidutiniškai daugiau išleidžia maistui - vyrai ar moterys?
Vyrai

In [40]:
data.groupby(['sex'])['total_bill'].mean()

sex
Female    18.056897
Male      20.744076
Name: total_bill, dtype: float64

## 10. Užduotis

Kas vidutiniškai daugiau išleidžia maistui - rūkantys ar ne?
rukantys
Kas daugiau rūko - vyrai ar moterys?
vyrai

In [41]:
data.groupby(['smoker'])['total_bill'].mean()

smoker
No     19.188278
Yes    20.756344
Name: total_bill, dtype: float64

In [42]:
data.groupby(['sex'])['smoker'].count()

sex
Female     87
Male      157
Name: smoker, dtype: int64